app/views/devise/registrations/new.html.erb

SELECT `roles`.* FROM `roles`
---

     <%= f.select :role, Role.all.collect {|role|[role.name]} %>